Revit 2026 API

# DocumentAutoJoinElements Method

---

Forces the elements in the Revit document to automatically join to their neighbors where appropriate.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AutoJoinElements()
```
```vb
Public Sub AutoJoinElements
```
```cpp
public:
void AutoJoinElements()
```
```fsharp
member AutoJoinElements : unit -> unit
```

| Exception | Condition |
| --- | --- |
| AutoJoinFailedException | Thrown when the operation fails. |

Use this method to force elements in the document to automatically join to their neighbors. Note that when a transaction is committed there is an automatic call to automatically join elements.

#### Reference

Document Class

Autodesk.Revit.DB Namespace